doc/list-comprehensions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>List comprehensions</title>
<!-- 2015-04-02 Thu 23:43 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../css/theme.css" type="text/css"/>
</head>
<body>
<div id="content">
<h1 class="title">List comprehensions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">A common pattern</a></li>
<li><a href="#unnumbered-2">List comprehension syntax</a></li>
<li><a href="#unnumbered-3">Filtering values in a list</a></li>
<li><a href="#unnumbered-4">Transforming values in a list</a></li>
<li><a href="#unnumbered-5">Tasks</a>
<ul>
<li><a href="#unnumbered-6">Cleaning a sequence</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">A common pattern</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
In the code you've written so far, you may have noticed some common
patterns. One of these looks something like this<a id="first-example"></a>:
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">new_list</span> = []
<span class="org-keyword">for</span> element <span class="org-keyword">in</span> old_list:
    <span class="org-keyword">if</span> some_condition:
        new_list.append(element)
</pre>
</div>

<p>
Let's revisit the GC content calculation for a specific example:
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">calculate_gc_ratio</span>(sequence):
    <span class="org-variable-name">gcs</span> = []
    <span class="org-keyword">for</span> base <span class="org-keyword">in</span> sequence:
        <span class="org-keyword">if</span> base <span class="org-keyword">in</span> [<span class="org-string">'G'</span>, <span class="org-string">'C'</span>]:
            gcs.append(base)
    <span class="org-keyword">return</span> <span class="org-builtin">len</span>(gcs)/<span class="org-builtin">len</span>(sequence)
</pre>
</div>

<p>
Do you see the pattern?
</p>

<p>
This is the pattern that is coveniently wrapped up in list
comprehensions.
</p>
</div>
</div>

<div id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">List comprehension syntax</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<p>
Here is the general pattern from above, transformed to a list
comprehension.
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">new_list</span> = [element <span class="org-keyword">for</span> element <span class="org-keyword">in</span> old_list <span class="org-keyword">if</span> some_condition]
</pre>
</div>

<p>
It looks a little backwards, so compare this to the <a href="#first-example">first example</a> and
try to match up parts. It says to check if each <code>element</code> in
<code>old_list</code> meets some condition. If it does, store it in a list, which
is being assigned to <code>new_list</code>. Notice that all of this is happening
in between the list notation <code>[ ... ]</code>.
</p>

<p>
Here is the gc function that uses a list comprehension:
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">calculate_gc_ratio</span>(sequence):
    <span class="org-variable-name">gcs</span> = [base <span class="org-keyword">for</span> base <span class="org-keyword">in</span> sequence <span class="org-keyword">if</span> base <span class="org-keyword">in</span> [<span class="org-string">'G'</span>, <span class="org-string">'C'</span>]]
    <span class="org-keyword">return</span> <span class="org-builtin">len</span>(gcs)/<span class="org-builtin">len</span>(sequence)
</pre>
</div>

<p>
Below are a few examples of the kind of things that are commonly done
with list comprehensions.
</p>
</div>
</div>

<div id="outline-container-unnumbered-3" class="outline-2">
<h2 id="unnumbered-3">Filtering values in a list</h2>
<div class="outline-text-2" id="text-unnumbered-3">
<p>
<code>calculate_gc_ratio</code> is an example of filtering a list to remove values
that don't fit a certain condition (in this case, bases that aren't a
"G" or "C").
</p>

<p>
Here's one more example that filters a list of numbers for even numbers.
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">numbers</span> = <span class="org-builtin">list</span>(<span class="org-builtin">range</span>(1, 11))
<span class="org-variable-name">evens</span> = [num <span class="org-keyword">for</span> num <span class="org-keyword">in</span> numbers <span class="org-keyword">if</span> num % 2 == 0]
<span class="org-keyword">print</span>(evens)
</pre>
</div>

<pre class="example">
[2, 4, 6, 8, 10]
</pre>

<p>
With the old pattern, this would look like this:
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">numbers</span> = <span class="org-builtin">list</span>(<span class="org-builtin">range</span>(1, 11))
<span class="org-variable-name">evens</span> = []
<span class="org-keyword">for</span> num <span class="org-keyword">in</span> numbers:
    <span class="org-keyword">if</span> num % 2 == 0:
        evens.append(num)
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-4" class="outline-2">
<h2 id="unnumbered-4">Transforming values in a list</h2>
<div class="outline-text-2" id="text-unnumbered-4">
<p>
Instead of (or in combination with) filtering a list, we can perform a
tranformation on all the list values.
</p>

<p>
As example, we can take a list of percentages and transform them into
ratios.
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">percents</span> = [99, 34, 89, 77, 88]
<span class="org-variable-name">ratios</span> = [percent/100 <span class="org-keyword">for</span> percent <span class="org-keyword">in</span> percents]
<span class="org-keyword">print</span>(ratios)
</pre>
</div>

<pre class="example">
[0.99, 0.34, 0.89, 0.77, 0.88]
</pre>

<p>
In this case, we simply divided by one hundred, but you could also apply
a function.
</p>
</div>
</div>

<div id="outline-container-unnumbered-5" class="outline-2">
<h2 id="unnumbered-5">Tasks</h2>
<div class="outline-text-2" id="text-unnumbered-5">
</div><div id="outline-container-unnumbered-6" class="outline-3">
<h3 id="unnumbered-6">Cleaning a sequence</h3>
<div class="outline-text-3" id="text-unnumbered-6">
<p>
Write a function that cleans a sequence by removing gaps and making sure
that all letters are capital. Make use of a single list comprehension in
your function. The list comprehension should take care of both removing
the gaps and capitalizing the base. Write tests (with <code>assert</code>
statements at the end of the file or with py.test) to show that your
function works as expected.
</p>

<pre class="example">
In [1]: clean_sequence('GGc--AGTT')
GGCAGTT
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="license">
Released under a
<a rel="license"
href="http://creativecommons.org/licenses/by-sa/3.0/deed.en_US">
Creative Commons Attribution-ShareAlike 3.0 Unported License</a>.
</p>
<p class="creator">Created with <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.3beta)</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
